r4d10n/esp32p4-wifi-rtlsdr/sdkconfig.defaults
# Target: ESP32-P4
CONFIG_IDF_TARGET="esp32p4"

# USB Host
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y

# WiFi via esp_wifi_remote + esp-hosted (matching reference project)
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# ESP-Hosted SDIO transport (Waveshare ESP32-P4-WIFI6)
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=25000
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4

# PSRAM
CONFIG_SPIRAM=y
# SPIRAM mode is auto-detected on ESP32-P4
CONFIG_SPIRAM_SPEED_80M=y

# Ethernet (IP101 PHY on Waveshare ESP32-P4-WIFI6)
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y

# lwIP — optimize for streaming
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_MAX_SOCKETS=16

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# HTTP Server — enable WebSocket support
CONFIG_HTTPD_WS_SUPPORT=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=4

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Custom partition table (2MB app)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
